name: "preprocessing"
backend: "python"

input [
{
    name: "preprocessing_input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]

}
]

output [
{
    name: "preprocessing_output"
    data_type: TYPE_FP32
    dims: [ -1, 3, 224, 224 ]
}
]

instance_group [{ kind: KIND_CPU }]